In [2]:
import pandas as pd

In [39]:
df = pd.read_csv('names.csv')

In [40]:
df.head()

  first_name
0      aabid
1     aabida
2     aachal
3     aadesh
4      aadil

In [ ]:
# columns to be deleted
col_to_drop = df.columns[0]
df = df.drop(columns=col_to_drop, axis = 1)

In [5]:
df.head()

     Name
0   aabid
1  aabida
2  aachal
3  aadesh
4   aadil

In [ ]:
# saving the modified DataFrame to a new CSV file
df.to_csv('names.csv', index=False)

In [4]:
# those names are not suffiecient for our projects so lets get some more names 
m_names = pd.read_csv('Indian-Male-Names.csv')
f_names = pd.read_csv('Indian-Female-Names.csv')

m_names.head(),f_names.head()

(              name gender    race
 0          barjraj      m  indian
 1     ramdin verma      m  indian
 2  sharat chandran      m  indian
 3  birender mandal      m  indian
 4             amit      m  indian,
               name gender    race
 0          shivani      f  indian
 1             isha      f  indian
 2  smt shyani devi      f  indian
 3            divya      f  indian
 4            mansi      f  indian)

In [5]:
m_names.head()

              name gender    race
0          barjraj      m  indian
1     ramdin verma      m  indian
2  sharat chandran      m  indian
3  birender mandal      m  indian
4             amit      m  indian

In [6]:
cols_to_drop = m_names.columns[1:]
m_names = m_names.drop(columns=cols_to_drop, axis=1)

In [12]:
m_names.head()

              name
0          barjraj
1     ramdin verma
2  sharat chandran
3  birender mandal
4             amit

In [ ]:
# split the name column into two parts and select the first name
m_names['first_name'] = m_names[m_names.columns[0]].str.split().str[0]

In [14]:
m_names.head()

              name first_name
0          barjraj    barjraj
1     ramdin verma     ramdin
2  sharat chandran     sharat
3  birender mandal   birender
4             amit       amit

In [ ]:
# drop the original name column after extracting first names
col_to_drop = m_names.columns[0]
m_names = m_names.drop(columns=col_to_drop, axis=1)

In [18]:
# Rename column if needed
m_names = m_names.rename(columns={m_names.columns[0]: 'first_name'})
df = df.rename(columns={df.columns[0]: 'first_name'})

# Then concatenate
combined = pd.concat([df, m_names], ignore_index=True)

In [20]:
df.describe()

       first_name
count        6485
unique       6485
top         zuveb
freq            1

In [21]:
combined.describe()

       first_name
count       21306
unique       6648
top        deepak
freq          213

In [22]:
f_names.head()

              name gender    race
0          shivani      f  indian
1             isha      f  indian
2  smt shyani devi      f  indian
3            divya      f  indian
4            mansi      f  indian

In [23]:
col_tod_delete = f_names.columns[1:]
f_names = f_names.drop(columns=col_tod_delete, axis=1)

In [24]:
f_names.head()

              name
0          shivani
1             isha
2  smt shyani devi
3            divya
4            mansi

In [25]:
# now lets select the only first names 
f_names['first_name'] = f_names[f_names.columns[0]].str.split().str[0]
f_names.head()

              name first_name
0          shivani    shivani
1             isha       isha
2  smt shyani devi        smt
3            divya      divya
4            mansi      mansi

In [26]:
# now remove the first column
col_to_drop = f_names.columns[0]
f_names = f_names.drop(columns=col_to_drop, axis=1)

In [31]:
# Rename column if needed
f_names = m_names.rename(columns={m_names.columns[0]: 'first_name'})
combined = combined.rename(columns={combined.columns[0]: 'first_name'})

# Then concatenate
combined = pd.concat([combined, f_names], ignore_index=True)

In [32]:
combined.describe()

       first_name
count       36127
unique       6648
top        deepak
freq          425

In [38]:
# now export those names to a csv file 
combined.to_csv('names.csv', index=False)

In [45]:
# there are somme names which are written in marati language so lets remove those names
import re

def is_latin(name):
    return bool(re.match(r'^[A-Za-z\s]+$', str(name)))

df = df[df[df.columns[0]].apply(is_latin)]
df = df.reset_index(drop=True)
df.head()

  first_name
0      aabid
1     aabida
2     aachal
3     aadesh
4      aadil

In [46]:
df.to_csv('names1.csv', index=False)